Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsWarn Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotJoinElementsWarn { get; }
Public Shared ReadOnly Property CannotJoinElementsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotJoinElementsWarn {
	FailureDefinitionId^ get ();
}
static member CannotJoinElementsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace